[
  {
    "id": 1,
    "courseName": "Learning Arabic",
    "imagePath": "/poster_square/learning_arabic.png",
    "title": "Learn Language of Qur'an and Hadith",
    "description": "Have you ever dreamed of mastering the language of the Qur'an? Wouldn't it be wonderful to understand the divine message sent by our Lord and the noble words of our beloved Prophet ﷺ? Imagine being able to delve into the treasures left by the early generations through Arabic texts and teaching your children this beautiful language with confidence.",
    "introduction": [
      "We spend much of our lives acquiring knowledge about worldly subjects, which serve us temporarily in this life. But learning Arabic this sacred language becomes a key to connecting with Allah's words and understanding the eternal guidance for our lives and beyond.",
      "An-Nahda Islamic Academy (NIA) proudly offers you the Learning Arabic Course, an immersive online program designed to make Arabic learning engaging, effective, and deeply rewarding under the guidance of skilled and dedicated instructors."
    ],
    "courseHighlights": {
      "title": "Why Choose Our Course?",
      "description": "Alhamdulillah, previous batches have surpassed all expectations, and our students have consistently excelled. Here's why our course stands out:",
      "features": [
        {"Live Sessions": "All classes are live and interactive, ensuring students can ask questions and gain clarity on lessons in real-time. No pre-recorded lectures."},
        {"Expert Guidance": "Experienced and qualified instructors provide continuous support. Any question, anytime—you'll receive prompt assistance."},
        {"Comprehensive Monitoring": "Attendance is strictly monitored, and every student's progress is tracked."},
        {"Holistic Skill Development": "Equal emphasis is placed on reading, writing, speaking, and understanding Arabic."},
        {"Individual Attention": "Each student recites in every class, ensuring personal feedback and improvement."},
        {"Practice Groups": "Dedicated practice partners are assigned for peer-to-peer learning, with supervised practice sessions to solidify skills."},
        {"Homework and Feedback": "Regular homework is assigned and reviewed meticulously, with corrections provided when necessary."},
        {"Writing Exercises": "Structured writing tasks help students refine their skills, with detailed feedback from instructors."},
        {"Conversation Practice": "Special focus is given to conversational Arabic, with dedicated group activities to enhance speaking fluency."},
        {"Qur'anic Application": "Lessons are reinforced with relevant Qur'anic verses, making the learning experience spiritually fulfilling."},
        {"Motivational Challenges": "Regular tests, competitions, and rewards keep students motivated and engaged."},
        {"Character Development": "Weekly sessions on Adab (manners) and Tarbiyah (nurturing) are conducted alongside language learning."},
        {"Make-Up Support": "Missed classes? Recordings are available, and instructors may provide personalized assistance to ensure students stay on track."}
      ]
    },
    "courseDetails": {
      "title": "Course Details:",
      "schedule": [
        {"Class Schedule": "Three days a week—Saturday, Monday, and Wednesday."},
        {"Morning Batch": "After Fajr."},
        {"Evening Batch": "8:00 PM."},
        {"courseLanguage": "Bangla, Arabic"},
        {"ageRequirement": "12+"},
        {"courseDuration": "3 months"},
        {"startingTime": "Next batch starts on February 1st, 2025"}
      ],
      "platform": "Classes are conducted via live audio sessions on Zoom.",
      "fees": {
        "courseFee": "650৳ (50% discount)",
        "scholarships": "Limited scholarships available for financially struggling students."
      }
    },
    "callToAction": {
      "title": "Enroll Today:",
      "description": "Don't miss this opportunity to embark on a journey of a lifetime. The Learning Arabic Course is not just about learning a language; it's about unlocking the key to understanding the Qur'an, the Sunnah, and the vast ocean of Islamic knowledge.",
      "encouragement": "Take the first step towards mastering Arabic and experiencing the joy of truly connecting with Allah's words. Enroll now and join the countless students who have already transformed their lives through this program."
    }
  },
  {
    "id": 2,
    "courseName": "Husn al-Khuluq",
    "imagePath": "/poster_square/husnul_khuluk.png",
    "title": "Husn al-Khuluq (The Beauty of Character)",
    "description": "Imagine a world where everyone treats each other with kindness, respect, and sincerity. Good character, or akhlaq, is the foundation of such a world, and it is a cornerstone of Islamic teachings. The Prophet Muhammad (peace be upon him) said, 'I was only sent to perfect good character.' The course Husn al-Khuluq offers you the chance to embark on a transformative journey to understand, cultivate, and embody the principles of noble character in your everyday life.",
    "introduction": [
      "Good character is not just a trait; it's a way of life that strengthens relationships, builds communities, and pleases Allah. In this course, you'll discover the timeless wisdom of the Qur'an and Sunnah that can guide you to refine your manners and embody the best version of yourself.",
      "An-Nahda Islamic Academy (NIA) proudly offers Husn al-Khuluq, an online course designed to help you grow spiritually, socially, and emotionally while learning from skilled and dedicated instructors."
    ],
    "courseHighlights": {
      "title": "What Awaits You in This Course?",
      "description": "This course is not just about learning; it's about self-discovery and growth. Together, we will explore:",
      "features": [
        {"Why Akhlaq Matters in Islam": "Understand the profound spiritual and social significance of good character."},
        {"The Impact of Noble Character": "Learn how akhlaq shapes relationships, strengthens communities, and pleases Allah."},
        {"Practical Steps to Develop Akhlaq": "Discover actionable ways to refine your manners and overcome personal weaknesses."},
        {"Situational Ethics": "Master the art of adjusting your behavior to reflect Islamic values in any situation."},
        {"Achieving Husn al-Khuluq": "Emulate the best role model—our beloved Prophet Muhammad (peace be upon him)—and cultivate inner beauty."},
        {"Islamic Etiquette": "Gain a clear understanding of how to interact ethically in personal, social, and professional spheres."},
        {"Exclusive Resources": "Access detailed course notes, reflective exercises, and a supportive learning community."},
        {"Interactive Sessions": "Share your thoughts, ask questions, and connect with like-minded individuals in a safe space."}
      ]
    },
    "courseDetails": {
      "title": "Course Details:",
      "schedule": [
        {"Mode of Learning": "Online, combining engaging pre-recorded videos, live discussions, and assignments."},
        {"Class Schedule": "Three days a week—Saturday, Monday, and Wednesday."},
        {"Interactive Live Discussions": "Scheduled at convenient times for students from different time zones."},
        {"courseLanguage": "Bangla, Arabic"},
        {"ageRequirement": "12+"},
        {"courseDuration": "2 months"},
        {"startingTime": "Next batch starts on March 1st, 2025"}
      ],
      "platform": "Classes are conducted via Zoom, with a mix of live and pre-recorded sessions.",
      "fees": {
        "courseFee": "1000tk",
        "scholarships": "Limited scholarships available for financially struggling students."
      }
    },
    "callToAction": {
      "title": "Enroll Today:",
      "description": "Don't miss this opportunity to embark on a journey of a lifetime. The Learning Arabic Course is not just about learning a language; it's about unlocking the key to understanding the Qur'an, the Sunnah, and the vast ocean of Islamic knowledge.",
      "encouragement": "Take the first step towards mastering Arabic and experiencing the joy of truly connecting with Allah's words. Enroll now and join the countless students who have already transformed their lives through this program."
    }
  },

  {
    "id": 3,
    "courseName": "Fiqh un-Nisa",
    "imagePath": "/poster_square/fiqhun_nisa.png",
    "title": "Fiqh un-Nisa (Understanding Women's Jurisprudence in Islam)",
    "description": "Women hold a central and elevated status in Islam, celebrated for their pivotal roles in families and society. Yet, navigating modern challenges while staying true to one's Islamic identity can be overwhelming without proper guidance. To empower and educate women in the light of Qur'an and Sunnah, An-Nahda Islamic Academy presents Fiqh un-Nisa, a comprehensive course tailored specifically for understanding the rules, rights, and responsibilities of women in Islam.",
    "introduction": [
      "This course is not just a learning experience—it is an invitation to rediscover the profound wisdom and beauty of being a Muslim woman, grounded in the knowledge that brings peace to the soul and alignment with Allah's guidance."
    ],
    "courseHighlights": {
      "title": "What Will You Learn?",
      "description": "Fiqh un-Nisa is designed to cover every essential aspect of a woman's life in Islam, including:",
      "features": [
        {"The Elevated Role of Women in Islam": "Explore the unique and dignified status Allah has granted to women and their pivotal contributions in all spheres of life."},
        {"Behavioral Etiquette and Daily Rulings": "Gain clarity on the principles and rulings guiding a woman's conduct in personal, familial, and social contexts."},
        {"Modern Challenges and Solutions": "Delve into contemporary issues such as workplace dynamics, societal expectations, and modern jurisprudential matters affecting women."},
        {"Essential Fiqh (Islamic Jurisprudence)": "Understand the rulings related to purification, prayer, modesty, marriage, motherhood, inheritance, and more."},
        {"Strengthening Connection with Allah": "Learn how to navigate life's responsibilities while remaining steadfast in faith and close to your Creator."},
        {"Expert Guidance on Complex Issues": "Receive scholarly insights on modern and sensitive topics that require careful navigation through the lens of Islamic teachings."}
      ]
    },
    "courseDetails": {
      "title": "Course Features:",
      "schedule": [
        {"Learning Methodology": "Online-based, combining pre-recorded video lectures, live Q&A sessions, and interactive discussions."},
        {"Course Materials": "Exclusive access to detailed notes, curated resources, and real-life case studies for practical learning."},
        {"Instructors": "Esteemed scholars and experienced educators specializing in women's fiqh and modern challenges."},
        {"courseLanguage": "Bangla, Arabic"},
        {"ageRequirement": "16+"},
        {"courseDuration": "3 months"},
        {"startingTime": "Next batch starts on March 15th, 2025"}
      ],
      "platform": "Classes are conducted online via a combination of video lectures and live sessions.",
      "fees": {
        "courseFee": "800tk",
        "scholarships": "Scholarships may be available for those in financial need upon application."
      }
    },
    "callToAction": {
      "title": "Enroll Today:",
      "description": "The journey to understanding begins with a single step. Fiqh un-Nisa is not just a course—it is your gateway to a life filled with clarity, purpose, and peace. Through this course, you will find practical solutions, scholarly insights, and a supportive community that shares your passion for knowledge.",
      "encouragement": "Take the first step toward becoming a woman who embodies Islamic wisdom and strength in every facet of life. Join Fiqh un-Nisa and discover how knowledge can empower you to thrive, grow, and live a life that pleases Allah."
    }
  },

  {
    "id": 4,
    "courseName": "Alima Course",
    "imagePath": "/poster_square/aleema.png",
    "title": "Alima Course: A Comprehensive Three-Year Journey",
    "description": "The Alima Course at An-Nahda Islamic Academy is a meticulously designed program that provides women with essential Islamic knowledge, fosters spiritual growth, and equips them to navigate modern challenges. Over three years, this transformative journey delves into Islamic fundamentals, enabling women to live with faith and purpose.",
    "introduction": [
      "In an ever-changing world, the pursuit of Islamic knowledge is a guiding light for Muslim women, empowering them to face life's challenges with wisdom and faith.",
      "The Alima Course is not merely academic; it is a transformative experience that prepares women to live with faith and purpose while addressing practical aspects of daily life."
    ],
    "courseHighlights": {
      "title": "Why Choose the Alima Course?",
      "description": "The Alima Course is tailored to meet the unique needs of modern Muslim women while preserving the timeless values of Islam.",
      "features": [
        {"Comprehensive Curriculum": "Divided into structured modules, this program ensures a gradual yet thorough understanding of Islamic sciences, including Qur'anic studies, Arabic language, Fiqh (jurisprudence), Aqidah (theology), and Islamic history."},
        {"Practical Application": "The course emphasizes practical understanding, enabling students to apply Islamic teachings in their daily lives while addressing contemporary issues."},
        {"World-Class Educators": "Our instructors bring a blend of academic excellence, experience, and dedication, ensuring personalized attention and guidance."},
        {"Interactive Learning": "Live and interactive classes encourage active participation, fostering a dynamic and supportive learning atmosphere."},
        {"Arabic Mastery": "Proficiency in Arabic is a cornerstone of the program, enabling students to connect with the Qur'an and other Islamic texts in their original language."},
        {"Character Development": "The course emphasizes moral and spiritual growth, helping students embody Islamic values in every aspect of life."},
        {"Modern Relevance": "Special sessions address how to maintain Islamic principles while navigating modern challenges such as balancing career, family, and spirituality."}
      ]
    },
    "courseDetails": {
      "title": "Course Features:",
      "schedule": [
        {"Class Schedule": "Classes are conducted three days a week with flexible timing options."},
        {"Morning Batch": "Available after Fajr."},
        {"Evening Batch": "Available at 8:00 PM."},
        {"courseLanguage": "Bangla, Arabic"},
        {"ageRequirement": "18+"},
        {"courseDuration": "3 years"},
        {"startingTime": "Next batch starts on April 1st, 2025"}
      ],
      "platform": "Classes are conducted via live audio sessions on Zoom.",
      "fees": {
        "courseFee": "650tk monthly",
        "scholarships": "Limited scholarships available for financially struggling students."
      },
      "features": [
        {"Arabic Proficiency": "Learn to read, write, and understand Arabic fluently, connecting deeply with the Qur'an and classical texts."},
        {"Qur'anic Studies": "Memorize and understand key verses, with tafsir (interpretation) to uncover the wisdom of Allah's words."},
        {"Fiqh and Aqidah": "Learn Islamic jurisprudence and theology to make informed decisions while understanding fundamental beliefs."},
        {"Hadith Sciences": "Study the sayings of the Prophet Muhammad ﷺ, including their applications and principles of authentication."},
        {"Contemporary Relevance": "Gain insights into applying Islamic teachings to modern challenges such as ethical dilemmas, family dynamics, and work-life balance."}
      ]
    },
    "callToAction": {
      "title": "Enroll Today:",
      "description": "The Alima Course is more than just a learning experience—it is a journey of spiritual growth and empowerment. Over three years, it equips women with the knowledge, skills, and confidence to live as informed and practicing Muslims in today's world.",
      "encouragement": "Join us at An-Nahda Islamic Academy and take the first step toward a brighter, more meaningful future. Enroll now and transform your life with this comprehensive program."
    }
  },

  {
    "id": 5,
    "courseName": "Parenting Course",
    "imagePath": "/poster_square/parenting.png",
    "title": "Parenting Course: A Comprehensive Journey",
    "description": "The Parenting Course at An-Nahda Islamic Academy is a meticulously designed program that provides parents with essential Islamic knowledge, fosters spiritual growth, and equips them to navigate modern challenges. Over three years, this transformative journey delves into Islamic fundamentals, enabling parents to live with faith and purpose.",
    "introduction": [
      "In an ever-changing world, the pursuit of Islamic knowledge is a guiding light for Muslim parents, empowering them to face life's challenges with wisdom and faith.",
      "The Parenting Course is not merely academic; it is a transformative experience that prepares parents to live with faith and purpose while addressing practical aspects of daily life."
    ],
    "courseHighlights": {
      "title": "Why Choose the Parenting Course?",
      "description": "The Parenting Course is tailored to meet the unique needs of modern Muslim parents while preserving the timeless values of Islam.",
      "features": [
        {"Comprehensive Curriculum": "Divided into structured modules, this program ensures a gradual yet thorough understanding of Islamic sciences, including Qur'anic studies, Arabic language, Fiqh (jurisprudence), Aqidah (theology), and Islamic history."},
        {"Practical Application": "The course emphasizes practical understanding, enabling parents to apply Islamic teachings in their daily lives while addressing contemporary issues."},
        {"World-Class Educators": "Our instructors bring a blend of academic excellence, experience, and dedication, ensuring personalized attention and guidance."},
        {"Interactive Learning": "Live and interactive classes encourage active participation, fostering a dynamic and supportive learning atmosphere."},
        {"Arabic Mastery": "Proficiency in Arabic is a cornerstone of the program, enabling parents to connect with the Qur'an and other Islamic texts in their original language."},
        {"Character Development": "The course emphasizes moral and spiritual growth, helping parents embody Islamic values in every aspect of life."},
        {"Modern Relevance": "Special sessions address how to maintain Islamic principles while navigating modern challenges such as balancing career, family, and spirituality."}
      ]
    },
    "courseDetails": {
      "title": "Course Features:",
      "schedule": [
        {"Class Schedule": "Classes are conducted three days a week with flexible timing options."},
        {"Morning Batch": "Available after Fajr."},
        {"Evening Batch": "Available at 8:00 PM."},
        {"courseLanguage": "Bangla, Arabic"},
        {"ageRequirement": "18+"},
        {"courseDuration": "3 years"},
        {"startingTime": "Next batch starts on April 1st, 2025"}
      ],
      "platform": "Classes are conducted via live audio sessions on Zoom.",
      "fees": {
        "courseFee": "650tk monthly",
        "scholarships": "Limited scholarships available for financially struggling students."
      },
      "features": [
        {"Arabic Proficiency": "Learn to read, write, and understand Arabic fluently, connecting deeply with the Qur'an and classical texts."},
        {"Qur'anic Studies": "Memorize and understand key verses, with tafsir (interpretation) to uncover the wisdom of Allah's words."},
        {"Fiqh and Aqidah": "Learn Islamic jurisprudence and theology to make informed decisions while understanding fundamental beliefs."},
        {"Hadith Sciences": "Study the sayings of the Prophet Muhammad ﷺ, including their applications and principles of authentication."},
        {"Contemporary Relevance": "Gain insights into applying Islamic teachings to modern challenges such as ethical dilemmas, family dynamics, and work-life balance."}
      ]
    },
    "callToAction": {
      "title": "Enroll Today:",
      "description": "The Parenting Course is more than just a learning experience—it is a journey of spiritual growth and empowerment. Over three years, it equips parents with the knowledge, skills, and confidence to live as informed and practicing Muslims in today's world.",
      "encouragement": "Join us at An-Nahda Islamic Academy and take the first step toward a brighter, more meaningful future. Enroll now and transform your life with this comprehensive program."
    }
  }
  
  
  
]
